[
   {
      "nama": "Sholawat Al-Fatih",
      "arab": "اللَّهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ، الْفَاتِحِ لِمَا أُغْلِقَ وَالْخَاتِمِ لِمَا سَبَقَ، وَ النَّاصِرِ الْحَقِّ بِالْحَقِّ، وَالْهَادِيْ إِلَى صِرَاطِكَ الْمُسْتَقِيْمِ وَعَلٰى آلِهِ حَقَّ قَدْرِهِ وَمِقْدَارِهِ العَظِيْمِ",
      "latin": "Allāhumma shalli wa sallim wa bārik 'alā sayyidinā Muhammadinil Fātihi limā ughliqa, wal khātimi limā sabaqa, wan nāshiril haqqā bil haqqi, wal hādī ilā shirātikal mustaqīm. Shallallāhu 'alayhi, wa 'alā ālihī, wa ashhābihī haqqa qadrihī wa miqdārihil 'azhīm.",
      "arti": "Ya Allah, limpahkanlah shalawat, salam, dan keberkahan kepada junjungan kami, Nabi Muhammad SAW, pembuka apa yang terkunci, penutup apa yang telah lalu, pembela yang hak dengan yang hak, dan petunjuk kepada jalan yang lurus. Semoga Allah melimpahkan sholawat kepadanya, keluarga, dan para sahabatnya dengan hak derajat dan kedudukannya yang agung."
   },
   {
      "nama": "Sholawat Nariyah",
      "arab": "اللَّهُمَّ صَلِّ صَلاَةً كَامِلَةً وَسَلِّمْ سَلاَمًا تَامًّا عَلىَ سَيِّدِنَا مُحَمَّدٍ الَّذِيْ تُنْحَلُ بِهَ الْعُقَدُ وَتَنْفَرِجُ بِهِ الْكُرَبُ وَتُقْضَى بِهِ الْحَوَائِجُ وَتُنَالُ بِهِ الرَّغَائِبُ وَحُسْنُ الْخَوَاتِيْمِ وَيُسْتَسْقَى الْغَمَامُ بِوَجْهِهِ الْكَرِيْمِ وَعَلىَ آلِهِ وَصَحْبِهِ عَدَدَ كُلِّ مَعْلُوْمٍ لَكَ",
      "latin": "Allahumma shollì sholaatan kaamìlatan Wa sallìm salaaman taaman ‘ala sayyìdìnaa Muhammadìn Alladzì tanhallu bìhìl ‘uqadu, wa tanfarìju bìhìl kurabu. Wa tuqdhaa bìhìl hawaa’ìju Wa tunaalu bìhìr raghaa’ìbu wa husnul khawaatìmì wa yustasqal ghomaamu bì wajhìhìl karììmì, wa ‘alaa aalìhì, wa shahbìhì ‘adada kullì ma’luumìn laka.",
      "arti": "Ya Allah, berikanlah sholawat yang sempurna dan salam yang sempurna kepada junjunganku Baginda Nabi Muhammad yang dengannya terlepas dari ikatan (kesusahan) dan dibebaskan dari kesulitan. Dan dengannya juga ditunaikan hajat dan diperoleh segala keinginan dan kematian yang baik, serta memberi siraman (kebahagiaan) kepada orang yang sedih dengan wajahnya yang mulia, juga kepada keluarganya, para shahabatnya, dengan seluruh ilmu yang Engkau miliki."
   },
   {
      "nama": "Sholawat Nuril Anwar",
      "arab": "اللَّهُمَّ صَلِّ عَلَى نُورِ الأَنْوَارِ. وَسِرِّ الأَسِرَارِ. وَتِرْيَاقِ الأَغْيَارِ. وَمِفْتَاحِ بَابِ الْنَسَارِ. سَيِّدِنَا مُحَمَّدٍ الْمُخْتَارِ. وَآلِهِ الأَطْهَارِ. وَأَصْحَابِهِ الأَخْيَارِ. عَدَد نِعَمِ الله وَأِفْضَالِهِ",
      "latin": "Allahumma Shalli ‘Alaa Nuuril Anwaari Wasirril Asraari, Watiryaaqil Aghyaari Wamiftaahi Baabil Yasaari, Sayyidinaa Wamaulaana Muhammadinil Muhtaari Wa Aalihil Ath Haari Wa Ash Haabihil Ahyaari ‘Adada Ni’amillaahi Wa Ifdhaalih.",
      "arti": "Ya Allah, limpahkanlah rahmat kepada cahaya dari segala cahaya, belakang layar dari segenap rahasia, penawar sedih dan kebingungan, pembuka pintu kemudahan, yakni junjungan kami, Nabi Muhammad saw. yang terpilih, keluarganya yang suci, dan para sahabatnya yang mulia sebanyak hitungan nikmat Yang Mahakuasa dan karunia-Nya"
   },
   {
      "nama": "Sholawat Ibrahimiyah",
      "arab": "اَللَّهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَعَلٰى آلِ سَيِّدِنَا مُحَمَّدٍ كَمَا صَلَّيْتَ عَلٰى سَيِّدِنَا إِبْرَاهِيْمَ وَعَلٰى آلِ سَيِّدِنَا إِبْرَاهِيْمَ و بَارِكْ عَلٰى سَيِّدِنَا مُحَمَّدٍ وَعَلٰى آلِ سَيِّدِنَا مُحَمَّدٍ كَمَا بَارَكْتَ عَلٰى سَيِّدِنَا إِبْرَاهِيْمَ وَعَلٰى آلِ سَيِّدِنَا إِبْرَاهِيْمَ فِيْ الْعَالَمِيْنَ إِنَّكَ حَمِيْدُ مَجِيْدٌ",
      "latin": "Allahuma Shalli ‘Alaa Sayyidinna Muhammad Wa’alaa Aali Sayyidinna Muhammadin Kamaa Shallaita ‘Alaa Sayyidinna Ibraahiima Wa’alaa Aali Sayyidinna Ibrahiima, Wabaarik ‘Alaa Aali Sayyidinna Muhammadain Kamaa Baarakta ‘Alaa Sayyidinna Ibraahima Wa‘Alaa Aali Sayyidina Ibraahima, Fil ‘Aalamiina Innaka Hamiidun Majiidun.",
      "arti": "Ya Allah, berilah kasih sayang kepada junjungan kita nabi Muhammad dan keluarganya sebagaimana Engkau memberi kasih sayangmMu kepada junjungan kita Nabi Ibrahim dan keluarganya. Dan berkatilah kepada junjungan kita nabi Muhammad dan keluarganya sebagaimana Engkau memberkati junjungan kita nabi Ibrahim dan kelurganya diantara makhluk makhlukmu, sesungguhnya Engkau Maha Terpuji dan Maha Mulia."
   },
   {
      "nama": "Sholawat Munjiyat",
      "arab": "اَللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ صَلاَةٌ تُنْجِيْنَا بِهَا مِنْ جَمِيْعِ الْاَهْوَالِ وَالْاٰفَاتِ وَتَقْضِيْ لَنَابِهَاجَمِيعَ الْحَاجَاتِ وَتُطَهِّرُنَابِهَا مِنْ جَمِيْعِ السَيِّئَاتِ وَتَرْفَعُنَابِهَا عِنْدَكَ اَعْلَى الدَّرَجَاتِ وَتُبَلِّغُنَابِهَا اَقْصَى الْغَايَاتِ مِنْ جَمِيْعِ الْخَيْرَاتِ فِى الْحَيَاةِ وَبَعْدَ الْمَمَاتِ",
      "latin": "Allahumma sholli ‘alaa sayyidinaa Muhammadin sholaatan tunjiinaa bihaa min jamii’il-ahwaali wal-aafaati wa taqdhii lanaa bihaa jamii’al-haajaati wa tuthahirunaa bihaa min jamii’is-sayyi’aati wa tarfa’unaa bihaa ‘indaka a’lad-darajaati wa tuballigunaa bihaa aqshal-gaayaati min jamii’il-khairaati fil-hayaati wa ba’dal-mamaati",
      "arti": "Ya Allah, limpahkanlah rahmat kepada junjungan kami Nabi Muhammad Saw yang melaluinya Engkau akan menyelamatkan kami dari semua keadaan yang menakutkan dan membahayakan, dengan rahmat itu Engkau akan mendatangkan semua hajat kami dan membersihkan semua keburukan kami, mengangkat kami pada derajat tertinggi , menyampaikan kami pada puncak tujuan, dari semua kebaikan di waktu hidup dan sesudah mati."
   },
   {
      "nama": "Sholawat Mukhotob",
      "arab": "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ قَدْ ضَاقَتْ حِيلَتِي أَدْرِكْنِي يَا رَسُولَ الله",
      "latin": "Allahumma Shalli wa Sallim 'Alaa Sayyidina Muhammad Qad Dhaaqat Hiilatii Adriknii Yaa Rasuulallah",
      "arti": "Ya Allah, bershalawatlah untuk junjungan kami Sayyiduna Muhammad, sungguh terasa sempit usahaku, maka rangkullah aku wahai Rasulullah."
   },
   {
      "nama": "Sholawat Hajjiyyah",
      "arab": "اَللّٰهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَلَاةً تُبَلِّغُنَا بِهَا حَجَّ بَيْتِكَ الْحَرَامِ وَزِيَارَةَ قَبْرِ نَبِيِّكَ عَلَيْهِ أَفْضْلُ الصَّلَاةِ وَالسَّلَامِ فِيْ لُطْفٍ وَعَافِيَةٍ وَسَلَامَةٍ وَبُلُوْغِ الْمَرَامِ وَعَلَى آلِهِ وَصَحْبِهٖ وَبَارِكْ وَسَلِّمْ",
      "latin": "Allahumma shalli ‘alaa sayyidinaa Muhammadin tuballighunaa bihaa hajja baitikal haraam wa ziyaarata qabri nabiyyika alaihi afdhalus shalaatu was salaamu fi luthfin wa ‘aafiyatin wa salaamatin wa bulughil maraam wa ‘alaa aalihi wa shahbihi wa barik wa sallim.",
      "arti": "Ya Allah, limpahkanlah rahmat atas junjungan kami Muhammad dengan berkah shalawat yang dapat menyampaikan kami dengannya untuk berkunjung ke rumah Mu yang mulia dan mengunjungi makam nabi-Mu, atasnya shalawat dan salam yang paling utama dalam kelembutan, sehat, selamat, dan tercapai cita-citanya, serta berkahilah dan salam untuk keluarganya dan sahabat-sahabatnya."
   },
   {
      "nama": "Sholawat Al-Nuraniyah/Badawi Kubro",
      "arab": "اَللَّهُمَّ صَلِّ وَسَلِّمْ وَباَرِكْ عَلٰى سَيِّدِناَ وَمَوْلاَناَ مُحَمَّدٍ شَجَرَةِ اْلأَصْلِ النُّوْرَانِيَّةِ، وَلَمْعَةِ الْقَبْضَةِ الرَّحْمَانِيَّةِ، وَأَفْضَلِ الْخَلِيْقَةِ اْلإِنْسَانِيَّةِ، وَأَ شْرَفِ الصُّوْرَةِ الْجَسْمَانِيَّةِ، وَمَعْدِنِ اْلأَسْرَارِ الرَّبَّانِيَّةِ، وَخَزَائِنِ الْعُلُوْمِ اْلإِصْطِفَائِيَّةِ، صَاحِبِ الْقَبْضَةِ اْلأَصْلِيَّةِ، وَالْبَهْجَةِ السَّنِيَّةِ، وَالرُّتْبَةِ الْعَلِيَّةِ، مَنِ انْدَرَجَتِ النَّبِيُّوْنَ تَحْتَ لِوَائِهِ، فَهُمْ مِنْهُ وَاِلَيْهِ، وَصَلِّ وَسَلِّمْ وَباَرِكْ عَلَيْهِ وَعَلٰى آلِهِ وَصَحْبِهِ عَدَدَ مَاخَلَقْتَ، وَرَزَقْتَ وَأَمَتَّ وَأَحْيَيْتَ اِلَى يَوْمِ تَبْعَثُ مَنْ أَفْنَيْتَ، وَسَلِّمْ تَسْلِيْمًاكَثِيْرًا وَالْحَمْدُ ِللهِ رَبِّ الْعَالَمِيْنَ",
      "latin": "Allahumma Shalli wa sallim wa baarik 'alaa sayyidinaa wa maulana Muhammadin Syajaratil Ashl an-Nuraniyyah wa lam'atil qabdhatir rahmaaniyyah wa afdhalil Khaliiqatil insaaniyyah wa asyrafish shuuratil jismaaniyyah wa ba'dinil asraarir rabbaaniyyah wa khazaainil 'uluumil ishthifaaiyyah shaahibil qabdhatil ashliyyah wal bahjatis saniyyah war rutbatil 'aliyyah manin darajatin nabiyyuuna tahta liwaaihi fahum minhu wa ilahi wa shalli wa sallim wa baarik 'alaihi wa 'alaa aalihi wa shahbihi 'adada maa khalaqta warazaqta wa abatta wa ahyaita ilaa yaumi tab'atsu man afnaita wa sallim tasliiman katsiira wal hamdulillaahi rabbil 'aalamiin.",
      "arti": "Ya Allah, bershalawatlah, bersalamlah, dan berkatilah sayyidina wa maulana Muhammad shallallahu 'alaihi wa sallam, pohon sumber cahaya, kilatan sentuhan kasih sayang, seutama-utamanya manusia, semulia-mulianya bentuk jasad, tempat mendulang rahasia-rahasia ketuhanan, khazanah ilmu-ilmu pilihan, pemilik sentuhan universal, kebanggaan yang agung, derajat keudukan yang tinggi di mana para nabi bergabung di bawah benderanya, mereka bersumber darinya dan akan kembali (berlindung) kepadanya. Dan bershalawatlah, bersalamlah, dan berkatilah beliau, dan kepada keluarga dan para sahabat beliau sebanyak bilangan makhluk yang telah Engkau ciptakan, lalu engkau beri rizki, lalu Engkau matikan dan Engkau hidupkan hingga hari di mana Engkau membangkitkan kembali makhluk yang telah Engkau hancurkan, dan bersalamlah dengan salam yang sebenar-benarnya, dan Segala pujia bagi Allah Tuhan semesta alam."
   },
   {
      "nama": "Sholawat Al Nur Al Dzati",
      "arab": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلٰى سَيِّدِنَا مُحَمَّدٍ نِالنُّوْرِ الذَّاتِيْ وَالسِّرِّ السَّارِيْ فِيْ سَائِرِ الأَسْمَاءِ وَالصِّفَاتِ",
      "latin": "Allaahumma shalli   wasallim ‘ala sayyidinaa Muhammadinin nuuridz dzaatii wassirrissaarii fii saairil asmaai wash shifaati wa’alaa aalihi washah bihii wasallim",
      "arti": "Ya Allah berikanlah rahmat keselamatan dan berkah kepada junjungan kita Nabi Muhammad SAW merupakan cahaya Dzat (Allah) dan merupakan raasia yang mengalir pada seluruh nama dan sifat dan berikanlah  pula salam sejahtera, barokah atas keluarganya dan para sahabatnya."
   },
   {
      "nama": "Sholawat Thibbil Qulub",
      "arab": "اللّٰهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ طِبِّ الْقُلُوْبِ وَدَوَائِهَا، وَعَافِيَةِ الْاَبْدَانِ وَشِفَائِهَا، وَنُوْرِ الْاَبْصَارِ وَضِيَائِهَا، وَعَلٰى اٰلِهِ وَصَحْبِهِ وَسَلِّم",
      "latin": "Allahumma Shalli ‘ala sayyidinaa muhammadin thibbil qulubi wa dawa ihaa wa ‘afiyatil abdaani wa syifaa ihaa wa nuuril abshoori wa dhiyaa ihaa wa ‘alaa aalihi wa shohbihi wa sallim",
      "arti": "Ya Allah limpahkan rahmat kepada junjungan kami nabi Muhammad Saw, sebagai obat hati dan penyembuhnya, penyehat badan dan kesembuhannya, sebagai penyinar penglihatan mata beserta cahayanya dan semoga rahmat tercurah limpahkan kepada para sahabat beserta keluarganya."
   },
   {
      "nama": "Sholawat Litawsi’il Arzaq",
      "arab": "اللَّهُمَّ صَلِّ عَلٰى سَيِّدِنَا مُحَمَّدٍ صَلَاةً تُوَسِّعُ بِهَا عَلَيْنَا الْأَرْزَاقَ وَيُحْسِنُ بِهاَ لَناَ الْأَخْلَاقَ وَعَلَى آلِهِ وِصَحْبِهِ وَسَلَّمَ",
      "latin": "Allahumma sholli ‘ala sayyidina muhammadin sholatan tuwassi’u biha ‘alainal arzaqa wa tuhassinu biha lanal akhlaqa wa ‘ala alihi wa shohbihi wa sallim",
      "arti": "Ya Allah, limpahkanlah rahmat kepada junjungan kami, Nabi Muhammad SAW, rahmat yang meluaskan rezeki bagi kami, yang menjadikan akhlak kami baik, dan semoga Allah melimpahkan rahmat kepada segenap keluarga dan sahabatnya."
   },
   {
      "nama": "Sholawat Ma'tsutroh",
      "arab": "اِنَّ اللّٰهَ وَمَلٰۤىِٕكَتَهٗ يُصَلُّوْنَ عَلَى النَّبِيِّۗ يٰٓاَيُّهَا الَّذِيْنَ اٰمَنُوْا صَلُّوْا عَلَيْهِ وَسَلِّمُوْا تَسْلِيْمًا",
      "latin": "Allaahumma Sholli ‘Alaa Muhammadin Nabiyyil Ummiyyi Wa‘Alaa Aalihi Wasalim",
      "arti": "Ya Allah, limpahkanlah sholawat kepada Muhammad yang tiada dapat membaca dan menulis (Ummy) dan semoga keselamatan tercurah kepada segenap keluarganya."
   }
]
